{
  "Warrior": [
    "Trial of Iron Arms – Do 10 push-ups.",
    "The Battle March – Run in place for 2 minutes.",
    "Shield of Endurance – Hold a plank for 30 seconds.",
    "Stretch of the Veteran – Stretch for 5 minutes.",
    "Squat of the Mountain – Do 15 squats.",
    "Scout’s Patrol – Walk outside for 10 minutes.",
    "Waters of Vitality – Drink a full glass of water.",
    "Jump of the War Drums – Do 20 jumping jacks.",
    "Breath of the Dragon – Practice deep breathing for 1 minute.",
    "Burpees of Fury – Do 5 burpees.",
    "Burden of the Strong – Carry a heavy object 3 times across the room.",
    "Core of Steel – Do 15 sit-ups.",
    "Stairs of Triumph – Take the stairs instead of the elevator.",
    "Rise of the Sentinel – Do 20 calf raises.",
    "Wall of Resolve – Hold a wall sit for 30 seconds.",
    "Balance of the Warrior – Stand on one leg for 30 seconds per side.",
    "Steps of the Legion – Do 10 lunges per leg.",
    "Chair of Trials – Do 15 tricep dips using a chair.",
    "March of the Guard – Walk around your dwelling once.",
    "Low Stance of Readiness – Hold a squat for 20 seconds.",
    "Fists of the Gladiator – Throw 25 shadow punches.",
    "Lift of the Champion – Raise an object overhead 10 times.",
    "Knees of Lightning – Do 10 high knees.",
    "Slow Push of the Titan – Perform 5 slow, controlled push-ups.",
    "Inventory of the Warrior – Record today’s meals as if rationing supplies."
  ],
  "Mage": [
    "Pages of the Arcane – Read 5 pages of a book.",
    "Meditation of the Sage – Meditate for 3 minutes.",
    "Scroll of Ideas – Write down one new idea.",
    "Rune of Words – Learn one new word.",
    "Chronicles of the World – Read a science or history article.",
    "Mage’s Journal – Write in your journal for 5 minutes.",
    "Harmonies of the Ether – Listen to calming music for 5 minutes.",
    "Grimoire of Gratitude – Record 3 things you’re thankful for.",
    "Lore Fragment – Learn a random fact.",
    "Study of the Arts – Spend 10 minutes studying something you enjoy.",
    "Breath of Clarity – Do a breathing exercise for 2 minutes.",
    "Sigils of the Wand – Sketch or doodle something magical.",
    "Vision of Knowledge – Watch an educational video.",
    "Verse of Power – Write a short poem or haiku.",
    "Incantation of Memory – Memorize a short quote.",
    "Riddle of Logic – Solve a simple puzzle.",
    "Dream Scribe – Record your dreams from last night.",
    "Workspace of Order – Organize your desk or workspace.",
    "Mysteries Uncovered – Research an unknown topic.",
    "Mage’s Goals – Write 3 goals for the week.",
    "Memory of the Mind – Recall 5 items in your room without looking.",
    "Sanctum of the Mind – Visualize a calm place for 1 minute.",
    "Self-Enchantment – Write an affirmation as a spell.",
    "Apprentice’s Lesson – Teach someone something you know.",
    "Potion of Calm – Drink tea or water mindfully."
  ],
  "Thief": [
    "Silent Step – Sneak quietly from one room to another.",
    "The Hidden Cache – Put 5 items back in their proper place.",
    "Reach of the Shadow – Do 10 toe touches.",
    "Tightrope Walk – Walk heel-to-toe across the room.",
    "Secret Cleanup – Tidy a hidden mess.",
    "Feet of the Quickling – Do fast foot taps for 15 seconds.",
    "Practice of Silence – Move silently for 1 minute.",
    "Thief’s Stash – Organize a drawer like hidden treasure.",
    "Side Step of Escape – Do 10 quick side steps.",
    "Hidden Relic – Hide an object in your lair.",
    "Stretch of the Nimble – Stretch your legs for 2 minutes.",
    "Shadow’s Challenge – Sneak past someone unnoticed (if possible).",
    "Clever Scheme – Write down a time-saving trick.",
    "Ninja’s Crouch – Hold a quiet squat for 20 seconds.",
    "Coin Collector’s Hunt – Gather loose coins in one spot.",
    "Swift Dodge – Do 10 fast side lunges.",
    "Den of Distraction – Remove one distraction from your lair.",
    "Dodging the Blades – Hold a squat and sway side-to-side.",
    "Balance of the Cat – Stand on one foot for up to 1 minute.",
    "Steps of Silence – Take 5 creak-free steps.",
    "Shadow Sparring – Dodge imaginary attacks for 15 seconds.",
    "Rearrange the Hoard – Stealthily reorder one shelf.",
    "The S-Quest – Find 3 items beginning with ‘S.’",
    "Legs of the Rogue – Do 10 leg lifts.",
    "Message to the Future – Write a secret note to your future self."
  ]
}